** TBD parse org-elements as sxp                                        :sxp:
:LOGBOOK:
- State "TODO"       from              [2023-09-25 Mon 15:23]
- State "TBD"        from "TODO"       [2023-12-13 Wed 18:10]
:END:
#+name: oe-init
#+begin_src emacs-lisp :results silent
  (slime-start)
#+end_src

#+begin_src lisp :results silent
  (ql:quickload :organ)
#+end_src

#+name: oe-form
#+begin_src emacs-lisp :results output replace
  (macroexpand-1 (org-element-parse-buffer))
#+end_src

#+RESULTS: oe-form

#+name: oe-sxp
#+begin_src lisp :results output :var in=oe-form()
  (let ((sxp (sxp:make-sxp)))
    ;; SIMPLE-READER-ERROR #\) when using read
    (sxp:wrap-from-string! sxp in)
    (describe sxp))
#+end_src

#+RESULTS: oe-sxp
: #<SXP:SXP {1001532593}>
:   [standard-object]
: 
: Slots with :INSTANCE allocation:
:   AST                            = NIL

